NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series1/EFM32GG11B/EFM32GG11B840F1024GQ64.svd
        <register>
          <name>IENC</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x02C</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFC7CFF</resetMask>
          <fields>
            <field>
              <name>MNGMNTDONE</name>
              <description>Disable management done interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXCMPLT</name>
              <description>Disable receive complete interrupt</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXUSEDBITREAD</name>
              <description>Disable receive used bit read interrupt</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXUSEDBITREAD</name>
              <description>Disable transmit used bit read interrupt</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXUNDERRUN</name>
              <description>Disable transmit buffer under run interrupt</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RTRYLMTORLATECOL</name>
              <description>Disable retry limit exceeded or late collision interrupt</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>AMBAERR</name>
              <description>Disable transmit frame corruption due to AMBA (AHB) error interrupt</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXCMPLT</name>
              <description>Disable transmit complete interrupt</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXOVERRUN</name>
              <description>Disable receive overrun interrupt</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RESPNOTOK</name>
              <description>Disable bresp/hresp not OK interrupt</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NONZEROPFRMQUANT</name>
              <description>Disable pause frame with non-zero pause quantum interrupt</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PAUSETIMEZERO</name>
              <description>Disable pause time zero interrupt</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PFRMTX</name>
              <description>Disable pause frame transmitted interrupt</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTPDLYREQFRMRX</name>
              <description>Disable PTP delay_req frame received interrupt</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTPSYNCFRMRX</name>
              <description>Disable PTP sync frame received interrupt</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTPDLYREQFRMTX</name>
              <description>Disable PTP delay_req frame transmitted interrupt </description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTPSYNCFRMTX</name>
              <description>Disable PTP sync frame transmitted interrupt </description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTPPDLYREQFRMRX</name>
              <description>Disable PTP pdelay_req frame received interrupt</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTPPDLYRESPFRMRX</name>
              <description>Disable PTP pdelay_resp frame received interrupt</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTPPDLYREQFRMTX</name>
              <description>Disable PTP pdelay_req frame transmitted interrupt</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>PTPPDLYRESPFRMTX</name>
              <description>Disable PTP pdelay_resp frame transmitted interrupt</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TSUSECREGINCR</name>
              <description>Disable TSU seconds register increment interrupt</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXLPIINDC</name>
              <description>Disable RX LPI indication interrupt</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>WOLEVNTRX</name>
              <description>Disable WOL event received interrupt</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TSUTIMERCOMP</name>
              <description>Disable TSU timer comparison interrupt.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IENRO</name>
          <description>Interrupt mask register</description>
          <addressOffset>0x030</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x3FFC7DFF</resetValue>
          <resetMask>0x3FFC7DFF</resetMask>
          <fields>
            <field>
              <name>MNGMNTDONE</name>
              <description>management done interrupt mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXCMPLT</name>
              <description>receive complete interrupt mask</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXUSEDBITREAD</name>
              <description>receive used bit read interrupt mask</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUSEDBITREAD</name>
              <description>transmit used bit read interrupt mask</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXUNDERRUN</name>
              <description>transmit buffer under run interrupt mask</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RTRYLMTORLATECOL</name>
              <description>Retry limit exceeded or late collision (gigabit mode only) interrupt mask</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AMBAERR</name>
              <description>Transmit frame corruption due to AMBA (AHB) error interrupt mask</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXCMPLT</name>
              <description>Transmit complete interrupt mask</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UNUSED</name>
              <description>Unused</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXOVERRUN</name>
              <description>Receive overrun interrupt mask</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RESPNOTOK</name>
              <description>bresp/hresp not OK interrupt mask</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NONZEROPFRMQUANT</name>
              <description>Pause frame with non-zero pause quantum interrupt mask</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PAUSETIMEZERO</name>
              <description>pause time zero interrupt mask</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PFRMTX</name>
              <description>pause frame transmitted interrupt mask</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPDLYREQFRMRX</name>
              <description>PTP delay_req frame received mask</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPSYNCFRMRX</name>
              <description>PTP sync frame received mask</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPDLYREQFRMTX</name>
              <description>PTP delay_req frame transmitted mask</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPSYNCFRMTX</name>
              <description>PTP sync frame transmitted mask</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPPDLYREQFRMRX</name>
              <description>PTP pdelay_req frame received mask</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPPDLYRESPFRMRX</name>
              <description>PTP pdelay_resp frame received mask</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPPDLYREQFRMTX</name>
              <description>PTP pdelay_req frame transmitted mask</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PTPPDLYRESPFRMTX</name>
              <description>PTP pdelay_resp frame transmitted mask</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSUSECREGINCR</name>
              <description>TSU seconds register increment mask</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RXLPIINDC</name>
              <description>RX LPI indication mask</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WOLEVNTRX</name>
              <description>WOL event received mask</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TSUTIMERCOMP</name>
              <description>TSU timer comparison interrupt mask.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PHYMNGMNT</name>
          <description>PHY management register</description>
          <addressOffset>0x034</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PHYRWDATA</name>
              <description>PHY read write data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE10</name>
              <description>Must be written with 10.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>REGADDR</name>
              <description>Register address - specifies the register in the PHY to access.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PHYADDR</name>
              <description>PHY address.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>5</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OPERATION</name>
              <description>Operation. For a Clause 45 frame: 00 is an addr, 01 is a write, 10 is a post read increment, 11 is a read frame. For a Clause 22 frame: 10 is a read, 01 is a write.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE1</name>
              <description>Must be written to 1 for a valid Clause 22 frame and to 0 for a valid Clause 45 frame.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WRITE0</name>
              <description>Must be written with 0.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RXPAUSEQUANT</name>
          <description>Received Pause Quantum Register</description>
          <addressOffset>0x038</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>QUANT</name>
              <description>Received pause quantum</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TXPAUSEQUANT</name>
          <description>Transmit Pause Quantum Register</description>
          <addressOffset>0x03C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0xFFFFFFFF</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>QUANT</name>
              <description>Transmit pause quantum</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QUANTP1</name>
              <description>Transmit pause quantum - written with the pause quantum value for pause frame transmission of priority 1.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PBUFTXCUTTHRU</name>
          <description>TX Partial Store and Forward</description>
          <addressOffset>0x040</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000003FF</resetValue>
          <resetMask>0x800003FF</resetMask>
          <fields>
            <field>
              <name>DMATXCUTTHRUTHR</name>
              <description>Watermark value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMATXCUTTHRU</name>
              <description>Enable TX partial store and forward operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PBUFRXCUTTHRU</name>
          <description>RX Partial Store and Forward</description>
          <addressOffset>0x044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x000003FF</resetValue>
          <resetMask>0x800003FF</resetMask>
          <fields>
            <field>
              <name>DMARXCUTTHRUTHR</name>
              <description>Watermark value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>10</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DMARXCUTTHRU</name>
              <description>Enable RX partial store and forward operation</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>JUMBOMAXLEN</name>
          <description>Maximum Jumbo Frame Size.</description>
          <addressOffset>0x048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00002800</resetValue>
          <resetMask>0x00003FFF</resetMask>
          <fields>
            <field>
              <name>JUMBOMAXLEN</name>
              <description>Maximum Jumbo Frame Size - resets to the gem_jumbo_max_length define value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMOD</name>
          <description>Interrupt moderation register</description>
          <addressOffset>0x05C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00FF00FF</resetMask>
          <fields>
            <field>
              <name>RXINTMOD</name>
              <description>Count of 800ns periods before bit 1 is set in the interrupt status register after a frame is received</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TXINTMOD</name>
              <description>Count of 800ns periods before bit 7 is set in the interrupt status register after a frame is transmitted</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYSWAKETIME</name>
          <description>System wake time</description>
          <addressOffset>0x060</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>SYSWAKETIME</name>
              <description>Count of 64ns, 320ns or 3200ns intervals before transmission starts after deassertion of tx_lpi_en</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
